Repository: Amereyeu/pinit
Catalog: po/extra/*.po
Languages: es, it, pt_br, sk

source: Pin shortcuts for your favorite portable apps to your app launcher
es: Crea accesos directos a tus aplicaciones portátiles favoritas en el iniciador de las aplicaciones

source: Pin shortcuts for portable apps like raw executable files, AppImage files, etc. to the app launcher on your desktop.
es: Crea accesos directos a las aplicaciones portátiles, como ejecutables sin formato, archivos de AppImage, etc., en el launcher de las aplicaciones de tu entorno de escritorio.

source: Other features include:
es: Otras características son:
it: Altre funzionalità includono:
sk: Ďalšie funkcie zahŕňajú:

source: Edit or delete created app entries without opening the file manager
es: Editar o eliminar las entradas de las aplicaciones creadas sin abrir el gestor de archivos
it: Modifica o elimina le voci dell'app create senza aprire il file manager
sk: Upravte alebo odstráňte vytvorené položky aplikácií bez otvorenia správcu súborov

source: Automatically add execution permission to the file you select
es: Añadir automáticamente el permiso de ejecución al archivo seleccionado
it: Aggiunge automaticamente l'autorizzazione di esecuzione al file selezionato
sk: K súborom, ktoré vyberiete, sa automaticky pridelí povolenie na spustenie

source: Syntax error detection
es: Detección de errores sintácticos
it: Rilevamento degli errori di sintassi
sk: Detekcia chýb syntaxe

source: Automatically save everything―your data in editing, last open view, and preferences
es: Guarda todo automáticamente: los datos de edición, la última vista abierta y las preferencias
it: Salva automaticamente tutto: i tuoi dati in fase di modifica, ultima visualizzazione aperta e preferenze
sk: Všetko sa automaticky ukladá – vaše úpravy, posledné otvorené zobrazenie a predvoľby

source: Files view in the light mode
es: Vista de los archivos en modo claro
it: Visualizzazione dei file in modalità chiara
sk: Zobrazenie súborov v svetlom režime

source: Edit view in the light mode
es: Editar la vista en modo claro
it: Modifica vista in modalità chiara
sk: Zobrazenie úprav v svetlom režime

source: Files view in the dark mode
es: Vista de los archivos en modo oscuro
it: Visualizzazione dei file in modalità scura
sk: Zobrazenie súborov v tmavom režime

source: Edit view in the dark mode
es: Editar la visión en modo oscuro
it: Modifica vista in modalità scura
sk: Zobrazenie úprav v tmavom režime

source: The release for celebrating the 2nd anniversary of the app!
es: ¡El lanzamiento para celebrar el 2º aniversario de la aplicación!

source: Fix deprecations in GTK 4.10
es: Arreglar las obsoletas en GTK 4.10

source: English grammatical changes (thanks to @BraidenPsiuk)
es: Cambios gramaticales en inglés (gracias a @BraidenPsiuk)

source: EditView: Make keys that is not required by the freedesktop.org specification optional
es: Editar la Vista: Hacer opcionales las claves no requeridas por freedesktop.org

source: CategoryChooser: Improve layout management
es: Selector de categorías: Mejorar la gestión del diseño

source: Fix navigate back shows empty window
es: Se corrigió un error por el cual regresar mostraba una ventana vacía

source: Update Flatpak runtime version
es: Actualizar la versión de Flatpak
it: Aggiorna la versione runtime di Flatpak
sk: Aktualizácia verzie behového prostredia Flatpak

source: Update translations
es: Actualizar las traducciones
it: Aggiornate le traduzioni
sk: Aktualizované preklady

source: The biggest and greatest updates come to "Pin It!":
es: Las actualizaciones más importantes llegan a "Pin It!":
it: Gli aggiornamenti più grandi e più importanti arrivano su "Pin It!":
sk: Najväčšie a najúžasnejšie aktualizácie prichádzajú do aplikácie „Pin It!“:

source: Redesign to fit modern desktop environments, including support for responsive design
es: Rediseño para adaptarse a los entornos de escritorio modernos, incluida la compatibilidad con el diseño adaptable
it: Riprogettato per adattarsi ai moderni ambienti desktop, incluso il supporto per il design reattivo
sk: Prepracovanie vzhľadu tak, aby vyhovoval moderným prostrediam, vrátane podpory adaptívneho dizajnu

source: Migrate to GTK 4, the latest version of GTK
es: Migrar a GTK 4, la última versión de GTK
it: Migrato a GTK 4, l'ultima versione di GTK
sk: Migrácia na GTK 4, čo je najnovšia verzia GTK

source: Other changes:
es: Otras modificaciones:
it: Altre modifiche:
sk: Ďalšie zmeny:

source: Support setting ".ico" files as the app icon
es: Admite la configuración de archivos ".ico" como icono de la aplicación
it: Supporta l'impostazione di file ".ico" come icona dell'app
sk: Podpora nastavenia súborov „.ico“ ako ikonky aplikácií

source: Support opening in a text editor
es: Admite la apertura en un editor de textos
it: Supporta l'apertura in un editor di testo
sk: Podpora otvárania v textovom editore

source: Fix window size cannot be resized on small displays
es: Se solucionó el problema de no poder cambiar el tamaño de la ventana en pantallas pequeñas
it: La dimensione della finestra fissa non può essere ridimensionata su schermi piccoli
sk: Oprava nemožnosti zmeniť veľkosť okna na malých obrazovkách

source: Show error dialogs when saving/deleting failed
es: Mostrar cuadros de diálogo de error cuando falla guardar/eliminar
it: Mostra le finestre di dialogo di errore quando il salvataggio/l'eliminazione non è riuscito
sk: Zobraziť dialógové okná chýb pri zlyhaní ukladania/odstránenia

source: Make sure not to add blank elements in generated desktop files
es: Asegúrate de no añadir elementos en blanco en los archivos de escritorio generados
it: Assicurati di non aggiungere elementi vuoti nei file desktop generati
sk: Uistiť sa, aby neboli pridávané prázdne prvky do vygenerovaných súborov pracovnej plochy

source: Don't overwrite the entire permission of the selected executable files
es: No sobrescribir todo el permiso de los ejecutables seleccionados
it: Non sovrascrivere l'intera autorizzazione dei file eseguibili selezionati
sk: Neprepisovať celé oprávnenie vybraných spustiteľných súborov

source: Give executable permission for the user only when they don't have it
es: Dar permiso de ejecución para el usuario sólo cuando no lo tiene
it: Concedi l'autorizzazione eseguibile per l'utente solo quando non ce l'ha
sk: Udeliť používateľovi oprávnenie na spustenie, len ak ho nemá

source: AppData: Fix release year
es: Datos de la aplicación: año de lanzamiento corregido
it: AppData: Corretto l'anno di rilascio
sk: Údaje aplikácie: Opravený rok vydania

source: Translation updates:
es: Actualizaciones de las traducciones:
it: Aggiornamenti di traduzione:
pt_br: Atualizações de tradução:
sk: Aktualizácie prekladov:

source: Update Italian translation (thanks to @albanobattistella)
es: Actualización de la traducción al italiano (gracias a @albanobattistella)
it: Aggiornata traduzione Italiana (grazie a @albanobattistella)
sk: Aktualizovaný preklad do taliančiny (vďaka @albanobattistella)

source: Check desktop environment on runtime
es: Comprobar el entorno de escritorio cuando se ejecuta
it: Controlla l'ambiente desktop in runtime
sk: Zistiť pracovné prostredie pri spustení aplikácie

source: Lessen scope of file access
es: Reducir el ámbito de acceso a los archivos
it: Riduci la portata dell'accesso ai file
sk: Znížený rozsah prístupu k súborom

source: Make window resizable
es: Cambiar el tamaño de la ventana
it: Rendi ridimensionabile la finestra
sk: Umožnenie zmeny veľkosti okna

source: EditView: Less strict on file names
es: Editar Vista: Menos estricto con los nombres de los archivos
it: Modifica Vista: meno severo sui nomi dei file
sk: Zobrazenie úprav: Menej obmedzení na pomenovanie súborov

source: Add Italian translation (thanks to @albanobattistella)
es: Añadir traducción al italiano (gracias a @albanobattistella)
it: Aggiunta traduzione italiana (grazie a @albanobattistella)
sk: Pridaný preklad do taliančiny (vďaka @albanobattistella)

source: Add Dutch translation (thanks to @Vistaus)
es: Añadir traducción al holandés (gracias a @Vistaus)
it: Aggiungi la traduzione in olandese (grazie a @Vistaus)
sk: Pridaný preklad do holandčiny (vďaka @Vistaus)

source: Update Japanese translation
es: Actualizar la traducción al japonés
it: Aggiornata traduzione giapponese
pt_br: Atualiza tradução Japonesa
sk: Aktualizácia prekladu do japončiny

source: Fix build error on other distros
es: Corregir error en la compilación en otras distribuciones
it: Corretto l'errore di compilazione su altre distribuzioni
sk: Opravené chyby kompilácie na ostatných distribúciách

source: FilesView: Properly center the dialog against the app window
es: Vista de archivos: Centrar correctamente el diálogo en la ventana de la aplicación
it: Visualizzazione file: centra correttamente la finestra di dialogo rispetto alla finestra dell'app
sk: Zobrazenie súborov: Správne vycentrovať dialóg pred oknom aplikácie

source: Restore last opened view and its state
es: Restaurar la última vista abierta y su estado
it: Ripristina l'ultima vista aperta e il suo stato
sk: Obnoviť naposledy otvorené zobrazenie a jeho stav

source: Add new style switcher
es: Añadir un nuevo conmutador de estilos
it: Aggiunto un nuovo selettore di stile
sk: Pridaný nový prepínač štýlov

source: Correct titlebar label when no app name specified
es: Corrección de la etiqueta de la barra de título cuando no se especifica el nombre de la aplicación
it: Corretto l'etichetta della barra del titolo quando non è specificato il nome dell'app
sk: Opravený štítok vrchnej lišty, keď nie je špecifikovaný názov aplikácie

source: Readable copies
es: Copias legibles
it: Copie leggibili
sk: Čitateľné kópie

source: FilesView: Ellipsize if label texts are too long
es: Vista del archivo: Ellipsize si los textos de las etiquetas son demasiado largos
it: Visualizzazione file: ellissi se i testi delle etichette sono troppo lunghi
sk: Zobrazenie súborov: Skrátiť štítok, ak je text príliš dlhý

source: Tell accepted file formats in FileChooser
es: Indicar los formatos de los archivos aceptados en FileChooser
it: Indica i formati di file accettati in Selezione file
sk: Zobraziť podporované formáty súborov v okne voľby súborov FileChooser

source: Add Brazilian Porguguese translation (thanks to @DanielTolentino)
es: Añadir traducción al portugués brasileño (gracias a @DanielTolentino)
it: Aggiunta la traduzione in portoghese brasiliano (grazie a @DanielTolentino)
sk: Pridaný preklad do brazílskej portugalčiny (vďaka @DanielTolentino)

source: EditView: Focus on file name entry by default
es: Cambiar la vista: centrarse en la entrada del nombre del archivo de forma predeterminada
it: Modifica visualizzazione: concentrarsi sulla voce del nome del file per impostazione predefinita
pt_br: Página de Edição: Foco no nome do arquivo por padrão
sk: Zobrazenie úprav: Predvolene označiť políčko na vkladanie názvu

source: FilesView: Make scrollable and fix the window get bigger if many entries
es: Vista de archivos: permite el desplazamiento y el cambio del tamaño de la ventana para múltiples registros
it: Visualizzazione file: reso scorrevole e fissa la finestra che diventa più grande se ci sono molte voci
pt_br: Página de Arquivos: Faz a página ralável e conserte a janela ficar maior se houver muitas entradas
sk: Zobrazenie súborov: Umožnené posúvanie a opravená chyba, keď sa okno zväčšovalo pri veľkom množstve položiek

source: Add French translation (thanks to @NathanBnm)
es: Añadir traducción al francés (gracias a @NathanBnm)
it: Aggiunta la traduzione francese (grazie a @NathanBnm)
pt_br: Adiciona tradução Francesa (agradecimentos a @NathanBnm)
sk: Pridaný preklad do francúzštiny (vďaka @NathanBnm)

source: Improved support for other desktop environments
es: Mayor compatibilidad con otros entornos de escritorio
it: Supporto migliorato per altri ambienti desktop
pt_br: Melhorias no suporte para outros ambientes de trabalho
sk: Zlepšenie podpory pre ostatné pracovné prostredia

source: Add execution permission on clicking the "Pin It!" button
es: ¡Añadir el permiso de ejecución al hacer clic en el botón de "Pin It!"
sk: Pridané povolenie spustenia po kliknutí na tlačidlo „Pin It!“ (Pripnúť!)

source: Add CategoryChooser
es: Añadir un selector de categoría
it: Aggiunto il selettore di categorie
pt_br: Adiciona SeletorDeCategoria
sk: Pridaná voľba kategórií CategoryChooser

source: Support Alt+Home to show welcome
es: Soporta Alt+Inicio para mostrar la bienvenida
it: Supporta Alt+Home per mostrare il benvenuto
pt_br: Suporta Alt+Home para exibir início
sk: Podpora Alt+Home pre zobrazenie privítania

source: Allow GPU acceralation by default
es: Permitir la aceleración de la GPU por defecto
it: Consente accelerazione GPU per impostazione predefinita
pt_br: Permite aceleração de GPU por padrão
sk: Predvolene zapnúť akceleráciu pomocou grafickej karty

source: Add 128px app icon (thanks to @hanaral)
es: Añadir el icono de la aplicación de 128px (gracias a @hanaral)
it: Aggiunta l'icona dell'app 128px (grazie a @hanaral)
pt_br: Adiciona ícone de formato 128px (agradecimentos a @hanaral)
sk: Pridaná ikonka veľkosti 128 pixelov (vďaka @hanaral)

source: Rounded window corners on any stylesheet (thanks to @JeysonFlores)
es: Esquinas de las ventana redondeadas en cualquier formato (gracias a @JeysonFlores)
it: Angoli delle finestre arrotondati su qualsiasi foglio di stile (grazie a @JeysonFlores)
pt_br: Cantos de janela arredondados em qualquer folha de estilo (agradecimentos a @JeysonFlores)
sk: Zaoblené rohy okna pri použití akéhokoľvek zoznamu štýlov (stylesheet) (vďaka @JeysonFlores)

source: Support multitouch gestures (thanks to @JeysonFlores)
es: Admite gestos multitáctiles (gracias a @JeysonFlores)
it: Supporta i gesti multitouch (grazie a @JeysonFlores)
pt_br: Suporte à gestos multitoques (agradecimentos a @JeysonFlores)
sk: Podpora viacdotykových gest (vďaka @JeysonFlores)

source: Fix unreadable description text in AppCenter
es: Corrección del texto de la descripción ilegible en AppCenter
it: Corretto il testo della descrizione illeggibile in AppCenter
pt_br: Corrige texto de descrição ilegível no AppCenter
sk: Opravený nečitateľný text popisu v AppCentre

source: Save and restore window position
es: Guardar y recuperar la posición de la ventana
it: Salva e ripristina la posizione della finestra
pt_br: Salvar e restaurar posição da janela
sk: Uložiť a obnoviť pozíciu okna

source: Add Spanish translation (thanks to @JeysonFlores)
es: Añadir traducción al español (gracias a @JeysonFlores)
it: Aggiunto la traduzione spagnola (grazie a @JeysonFlores)
pt_br: Adiciona tradução em Espanhol (agradecimentos a @JeysonFlores)
sk: Pridaný preklad do španielčiny (vďaka @JeysonFlores)

source: Initial release
es: Versión inicial
it: Versione iniziale
pt_br: Lançamento inicial
sk: Prvé vydanie

source: Desktop File Creator
es: Creador de archivos de escritorio
it: Creatore di File Desktop
pt_br: Criador de arquivos de desktop
sk: Tvorba súborov pracovnej plochy

source: Desktop;File;Create;Edit;Info;Icon;AppImage;
es: Escritorio;Archivo;Crear;Editar;Info;Icono;AppImage;
it: Desktop;File;Crea;Modifica;Info;Icona;AppImage;
pt_br: Desktop;Arquivo;Criar;Editar;Info;Ícone;AppImage;
sk: Pracovná plocha;Súbor;Vytvoriť;Upraviť;Info;Informácie;Ikonka;AppImage;

source: Create the shortcut to your favorite portable apps into your app launcher
it: Crea il collegamento alle tue app portatili preferite nel tuo programma di avvio
sk: Vytvorte skratku k vašim obľúbeným prenosným aplikáciám v spúšťači aplikácií

source: Create the shortcut to portable apps like raw executable files, AppImage files, etc. into the app launcher of your desktop environment.
it: Crea il collegamento ad app portatili come file eseguibili, file AppImage, ecc. nel programma di avvio delle app del tuo ambiente desktop.
sk: Vytvorte skratku k prenosným aplikáciám, ako napríklad spúšťateľným súborom, súborom AppImage, atď. v spúšťači aplikácií vášho pracovného prostredia.

source: Add execution permisson on clicking the "Pin It!" button
it: Aggiunto il permesso di esecuzione facendo clic sul pulsante "Pin It!"
pt_br: Adiciona permissão de execução ao clicar no botão "Pin It!"

source: Pin any apps into the launcher
pt_br: Fixe qualquer aplicativo no lançador

source: Welcome View
pt_br: Página Inicial

source: Files View
pt_br: Página de Arquivos

source: Edit View
pt_br: Página de Edição
